---

title: GETRANGE(getrange)
copyright: true
date: 2020-04-02 13:02:02
categories: 
- Redis命令大全
- String
keywords: Redis命令,getrange
aside: string

---
## GETRANGE key start end 
>起始版本：2.4.0<br/>时间复杂度：O(N) N是字符串长度，复杂度由最终返回长度决定，但由于通过一个字符串创建子字符串是很容易的，它可以被认为是O(1)。  


#### 说明:
* 警告：这个命令是被改成GETRANGE的，在小于2.0的Redis版本中叫SUBSTR。 返回key对应的字符串value的子串，这个子串是由start和end位移决定的（两者都在string内）。可以用负的位移来表示从string尾部开始数的下标。所以-1就是最后一个字符，-2就是倒数第二个，以此类推。
* 这个函数处理超出范围的请求时，都把结果限制在string内。

#### 返回值

**bulk-reply**


#### 示例

```c
redis> SET mykey "This is a string"
OK
redis> GETRANGE mykey 0 3
"This"
redis> GETRANGE mykey -3 -1
"ing"
redis> GETRANGE mykey 0 -1
"This is a string"
redis> GETRANGE mykey 10 100
"string"
redis> 
```